ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
//===-- RL78MCCodeEmitter.cpp - Convert RL78 code to machine code -------===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file implements the RL78MCCodeEmitter class.
//
//===----------------------------------------------------------------------===//

#include "RL78.h"
#include "RL78MCExpr.h"
#include "llvm/ADT/Statistic.h"
#include "llvm/MC/MCCodeEmitter.h"
#include "llvm/MC/MCContext.h"
#include "llvm/MC/MCInstrInfo.h"
#include "llvm/Support/EndianStream.h"

using namespace llvm;

#define DEBUG_TYPE "mccodeemitter"

STATISTIC(MCNumEmitted, "Number of MC instructions emitted");

namespace {

class RL78MCCodeEmitter : public MCCodeEmitter {
  const MCInstrInfo &MCII;
  MCContext &Ctx;

public:
  RL78MCCodeEmitter(const MCInstrInfo &mcii, MCContext &ctx)
      : MCII(mcii), Ctx(ctx) {}
  RL78MCCodeEmitter(const RL78MCCodeEmitter &) = delete;
  RL78MCCodeEmitter &operator=(const RL78MCCodeEmitter &) = delete;
  ~RL78MCCodeEmitter() override = default;

  void encodeInstruction(const MCInst &MI, raw_ostream &OS,
                         SmallVectorImpl<MCFixup> &Fixups,
                         const MCSubtargetInfo &STI) const override;

  // getBinaryCodeForInstr - TableGen'erated function for getting the
  // binary encoding for an instruction.
  uint64_t getBinaryCodeForInstr(const MCInst &MI,
                                 SmallVectorImpl<MCFixup> &Fixups,
                                 const MCSubtargetInfo &STI) const;

  /// getMachineOpValue - Return binary encoding of operand. If the machine
  /// operand requires relocation, record the relocation and return zero.
  unsigned getMachineOpValue(const MCInst &MI, const MCOperand &MO,
                             SmallVectorImpl<MCFixup> &Fixups,
                             const MCSubtargetInfo &STI) const;

  unsigned
  getTargetOpValue(const MCInst &MI, unsigned OpNo, uint32_t offset,
                   SmallVectorImpl<MCFixup> &Fixups, const MCSubtargetInfo &STI,
                   enum MCFixupKind fixup1) const;

  unsigned getBranchOnRegTargetOpValue(const MCInst &MI, unsigned OpNo,
                                       SmallVectorImpl<MCFixup> &Fixups,
                                       const MCSubtargetInfo &STI) const;

private:
  FeatureBitset computeAvailableFeatures(const FeatureBitset &FB) const;
  void
  verifyInstructionPredicates(const MCInst &Inst,
                              const FeatureBitset &AvailableFeatures) const;
};

} // end anonymous namespace

static std::map<unsigned, unsigned> sfrRegisterToSfraddr{
    {RL78::SPL, 0xffff8}, {RL78::SPH, 0xffff9}, {RL78::PSW, 0xffffa},
    {RL78::CS, 0xffffc},  {RL78::ES, 0xffffd},  {RL78::PMC, 0xffffe},
    {RL78::MEM, 0xfffff},
};

static void
encode8BitRROperationInstruction(const MCInst &MI, unsigned long long &Bits,
                                 const unsigned short &OpcodeRA,
                                 const unsigned short &OpcodeASaddr) {
  //
  if (MI.getOperand(0).getReg() == RL78::R1) {

    if (MI.getOperand(2).getReg() == RL78::R1)
      Bits = OpcodeRA + MI.getOperand(0).getReg() - RL78::R0;
    // OP A, r.
    else if (MI.getOperand(2).getReg() < RL78::R8)
      Bits += MI.getOperand(2).getReg() - RL78::R0;
  }
  // OP r, A.
  else {
    RL78ReportError(MI.getOperand(2).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    Bits = OpcodeRA + MI.getOperand(0).getReg() - RL78::R0;
  }
}

static void
encode8BitCMPOperationInstruction(const MCInst &MI, unsigned long long &Bits,
                                  const unsigned short &OpcodeRA,
                                  const unsigned short &OpcodeASaddr) {
  //
  if (MI.getOperand(0).getReg() == RL78::R1 &&
      MI.getOperand(1).getReg() != RL78::R1) {
    // OP A, r.
    Bits += MI.getOperand(1).getReg() - RL78::R0;
  }
  // OP r, A.
  else {
    RL78ReportError(MI.getOperand(1).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    Bits = OpcodeRA + MI.getOperand(0).getReg() - RL78::R0;
  }
}
static void encode8BitRMEMRIOperationInstruction(
    const MCInst &MI, unsigned long long &Bits, unsigned &Size,
    const unsigned short &OpcodeShort, const unsigned &OpcodeLong) {
  // OP A, [HL].
  if (MI.getOperand(3).isImm() && MI.getOperand(3).getImm() == 0) {
    Size = 1;
    Bits = OpcodeShort;
  }
  // OP A, [HL+byte].
  else {
    Size = 2;
    Bits = OpcodeLong;
  }
}

static void encodeBitManip1RInstruction(const MCInst &MI,
                                        unsigned long long &Bits,
                                        const unsigned short &Opcode,
                                        const unsigned ImmIndex) {
  // OP A.bit.
  assert(MI.getOperand(0).getReg() == RL78::R1);
  Bits = Opcode;
  RL78ReportError(MI.getOperand(ImmIndex).getImm() >= 0 &&
                      MI.getOperand(ImmIndex).getImm() < 8,
                  "Instruction using operand outside of range 0-7.");
  Bits += MI.getOperand(ImmIndex).getImm() << 4;
}

void RL78MCCodeEmitter::encodeInstruction(const MCInst &MI, raw_ostream &OS,
                                          SmallVectorImpl<MCFixup> &Fixups,
                                          const MCSubtargetInfo &STI) const {
  verifyInstructionPredicates(MI,
                              computeAvailableFeatures(STI.getFeatureBits()));

  unsigned long long Bits = getBinaryCodeForInstr(MI, Fixups, STI);
  unsigned Size = MCII.get(MI.getOpcode()).getSize();
  switch (MI.getOpcode()) {
  case RL78::MOV_A_PSW:
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    break;
  case RL78::MOV_PSW_A:
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    break;
  case RL78::MOV_r_imm:
    // MOV r, #byte      5X data (X..H -> 0..7)
    Bits += ((MI.getOperand(0).getReg() - RL78::R0) << 8);
    //
    Bits |= getTargetOpValue(MI, 1, 1, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::STORE8_saddr_imm:
    Bits |= (getTargetOpValue(MI, 0, 1, Fixups, STI,
                              (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD) &
             0x00FF)
            << 8;
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::MOV_es_imm:
    // MOV ES, #byte;   41 data.
    Bits = 0x4100;
    Size = 2;
    Bits |= getTargetOpValue(MI, 1, 1, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::MOV_cs_imm:
    // MOV CS, #byte ;CE FC data.
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::MOV_es_saddr:
    // MOV ES, saddr;     61 B8 saddr.
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD) &
            0xFF;
    break;
  case RL78::MOV_psw_imm:
    // MOV PSW, #byte ;CE FA data.
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::MOV_A_sfr: {
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(1).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "sfr operand not in range");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::MOV_A_sfrReg:
    // MOV A, sfr ;8E sfr.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    Bits |= sfrRegisterToSfraddr[MI.getOperand(1).getReg()] & 0xFF;
    break;
  case RL78::MOV_sfr_A: {
    // MOV sfr, A ;9E sfr.
    RL78ReportError(MI.getOperand(1).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(0).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(0).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "sfr operand not in range");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::MOV_sfrReg_A:
    // MOV sfr, A ;9E sfr.
    RL78ReportError(MI.getOperand(1).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    Bits |= sfrRegisterToSfraddr[MI.getOperand(0).getReg()] & 0xFF;
    break;
  case RL78::MOV_sfr_imm: {
    RL78ReportError(MI.getOperand(0).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(0).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "sfr operand not in range");
    Bits |= (immediateValue & 0xFF) << 8;
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  }
  case RL78::MOV_sfrReg_imm:
    Bits |= (sfrRegisterToSfraddr[MI.getOperand(0).getReg()] & 0xFF) << 8;
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::STORE8_abs16_imm: {
    // MOV !addr16, #byte    CF adrl adrh data.
    Bits |= getTargetOpValue(MI, 1, 3, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 16;
    unsigned int uaddr = (0xFF00 & addressValue);
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::STORE8_stack_slot_imm:
    // MOV [SP+byte], #byte	C8 adr data.
    Bits |= (getTargetOpValue(MI, 1, 1, Fixups, STI,
                              (MCFixupKind)RL78::fixup_RL78_DIR8U) &
             0xFF)
            << 8;
    Bits |= getTargetOpValue(MI, 2, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::STORE8_memDEi_imm:
  case RL78::STORE8_memHLi_imm:
  case RL78::STORE8_ri_imm:
  case RL78::STORE8_rbci_imm: {
    unsigned int RegOp = MI.getOperand(0).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Invalid register for Instruction");
    // MOV [DE+byte], #byte	CA adr data.
    // MOV [HL+byte], #byte	CC adr data.
    // TODO: insert asserts here and in similar places.
    if (RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {
      Size = 3;
      Bits = (RegOp == RL78::RP4) ? 0xCA0000 : 0xCC0000;
      Bits |= (getTargetOpValue(MI, 1, 1, Fixups, STI,
                                (MCFixupKind)RL78::fixup_RL78_DIR8U) &
               0xFF)
              << 8;
      Bits |= getTargetOpValue(MI, 2, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    // MOV word[BC], #byte	39 adrl adrh data.
    // MOV word[B], #byte	19 adrl adrh data.
    // MOV word[C], #byte	38 adrl adrh data.
    else {
      if (RegOp == RL78::RP2)
        Bits = 0x39000000;
      else if (RegOp == RL78::R2)
        Bits = 0x38000000;
      else if (RegOp == RL78::R3)
        Bits = 0x19000000;
      Size = 4;
      unsigned int addressValue = getTargetOpValue(
          MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
      Bits |= (addressValue & 0xFF00) | ((addressValue & 0xFF) << 16);
      Bits |= getTargetOpValue(MI, 2, 3, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::STORE8_abs16_r: {

    // MOV !addr16, A    9F adrl adrh.
    RL78ReportError(MI.getOperand(1).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::MOV_A_r:
    // MOV A, X          60
    // MOV A, C          62
    // MOV A, B          63
    // MOV A, E          64
    // MOV A, D          65
    // MOV A, L          66
    // MOV A, H          67
    Bits |= MI.getOperand(1).getReg() - RL78::R0;
    break;
  case RL78::MOV_r_A:
    // MOV X, A          70
    // MOV C, A          72
    // MOV B, A          73
    // MOV E, A          74
    // MOV D, A          75
    // MOV L, A          76
    // MOV H, A          77
    Bits |= MI.getOperand(0).getReg() - RL78::R0;
    break;
  case RL78::LOAD8_rlo_saddr:
    // MOV A, saddr      8D saddr
    // MOV X, saddr      D8 saddr
    // MOV B, saddr      E8 saddr
    // MOV C, saddr      F8 saddr
    switch (MI.getOperand(0).getReg()) {
    case RL78::R0:
      Bits = 0xD800;
      break;
    case RL78::R3:
      Bits = 0xE800;
      break;
    case RL78::R2:
      Bits = 0xF800;
      break;
    }
    Bits |= getTargetOpValue(MI, 1, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD) &
              0xFF;
    break;
  case RL78::STORE8_saddr_A:
    // MOV saddr, A      9D saddr
    Bits |= getTargetOpValue(MI, 0, 1, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD) &
            0xFF;
    break;
  case RL78::LOAD8_r_memHL:
  case RL78::LOAD8_r_memDE:
  case RL78::LOAD8_r_memHLi:
  case RL78::LOAD8_r_memDEi:
  case RL78::LOAD8_r_ri:
  case RL78::LOAD8_r_rbci: {
    // MOV A, [DE]       89.
    // MOV A, [HL]       8B.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");

    unsigned int RegOp = MI.getOperand(1).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Instruction using illegal register.");

    if (MI.getOperand(2).isImm() && MI.getOperand(2).getImm() == 0 &&
        RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {
      Size = 1;
      Bits = (RegOp == RL78::RP4) ? 0x89 : 0x8B;
    }
    // MOV A, [DE+byte]  8A adr.
    // MOV A, [HL+byte]  8C adr.
    else if (RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {
      Size = 2;
      Bits = (RegOp == RL78::RP4) ? 0x8A00 : 0x8C00;
      unsigned int addr = getTargetOpValue(MI, 2, 1, Fixups, STI,
                                           (MCFixupKind)RL78::fixup_RL78_DIR8U);
      Bits |= addr & 0xFF;
    }
    // MOV A, word[BC]   49 adrl adrh.
    else {

      if (RegOp == RL78::RP2)
        Bits = 0x490000;
      else if (RegOp == RL78::R2)
        Bits = 0x290000;
      else if (RegOp == RL78::R3)
        Bits = 0x090000;

