ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
      unsigned int addressValue = getTargetOpValue(
          MI, 2, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
      unsigned int laddr = (0x00FF & addressValue) << 8;
      unsigned int uaddr = (0xFF00 & addressValue) >> 8;

      Size = 3;
      Bits |= (uaddr | laddr);
    }
    break;
  }
  case RL78::STORE8_memDE_r:
  case RL78::STORE8_memHL_r:
  case RL78::STORE8_memDEi_r:
  case RL78::STORE8_memHLi_r:
  case RL78::STORE8_ri_r:
  case RL78::STORE8_rbci_r: {
    // MOV [DE], A       99.
    // MOV [HL], A       9B.
    RL78ReportError(MI.getOperand(2).getReg() == RL78::R1,
                    "Instruction using illegal register.");

    unsigned int RegOp = MI.getOperand(0).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Instruction using illegal register.");

    if (MI.getOperand(1).isImm() && MI.getOperand(1).getImm() == 0 &&
        RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {
      Size = 1;
      Bits = (RegOp == RL78::RP4) ? 0x99 : 0x9B;
    }
    // MOV [DE+byte], A  9A adr.
    // MOV [HL+byte], A  9C adr.
    else if (RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {
      Size = 2;
      Bits = (RegOp == RL78::RP4) ? 0x9A00 : 0x9C00;
      Bits |= getTargetOpValue(MI, 1, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    // MOV word[BC], A   48 adrl adrh.
    else {
      if (RegOp == RL78::RP2)
        Bits = 0x480000;
      else if (RegOp == RL78::R2)
        Bits = 0x280000;
      else if (RegOp == RL78::R3)
        Bits = 0x180000;
      Size = 3;
      unsigned int addressValue = getTargetOpValue(
          MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
      Bits |= ((addressValue & 0xFF00) >> 8) | ((addressValue & 0xFF) << 8);
    }
    break;
  }
  case RL78::LOAD8_r_stack_slot:
    // MOV A, [SP+byte]  88 adr.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::STORE8_stack_slot_r: {
    // MOV [SP+byte], A  98 adr.
    RL78ReportError(MI.getOperand(2).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(MI, 1, 1, Fixups, STI,
                                         (MCFixupKind)RL78::fixup_RL78_DIR8U);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::LOAD8_r_memrr:
    // MOV A, [HL+B]     61 C9.
    // MOV A, [HL+C]     61 E9.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::R2 || MI.getOperand(2).getReg() == RL78::R3,
                    "Instruction using illegal register.");
    if (MI.getOperand(2).getReg() == RL78::R2)
      Bits += 0x20;
    break;
  case RL78::STORE8_memrr_r:
    // MOV [HL+B], A     61 D9
    // MOV [HL+C], A     61 F9
    RL78ReportError(MI.getOperand(2).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).getReg() == RL78::R2 || MI.getOperand(1).getReg() == RL78::R3,
                    "Instruction using illegal register.");
    if (MI.getOperand(1).getReg() == RL78::R2)
      Bits += 0x20;
    break;
  case RL78::LOAD8_r_abs16: {
    // MOV A, !addr16    8F adrl adrh.
    // MOV B, !addr16    E9 adrl adrh.
    // MOV C, !addr16    F9 adrl adrh.
    // MOV X, !addr16    D9 adrl adrh.
    switch (MI.getOperand(0).getReg()) {
    case RL78::R0:
      Bits = 0xD90000;
      break;
    case RL78::R1:
      Bits = 0x8F0000;
      break;
    case RL78::R2:
      Bits = 0xF90000;
      break;
    case RL78::R3:
      Bits = 0xE90000;
      break;
    default:
      RL78ReportError(false, "Instruction using illegal register.");
    }
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;

    Size = 3;
    Bits |= (uaddr | laddr);
    break;
  }

  case RL78::MOV_esaddr16_imm: {
    // MOV ES:!addr16, #byte ;11 CF adrl adrh data.
    Bits |= getTargetOpValue(MI, 2, 4, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 16;
    unsigned int uaddr = (0xFF00 & addressValue);
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::MOV_esaddr16_a: {
    // MOV ES:!addr16, A ;11 9F adrl adrh.
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::MOV_r_esaddr16: {
    // MOV A, ES:!addr16 ;11 8F adrl adrh 
    // MOV B, ES:!addr16 ;11 E9 adrl adrh.
    // MOV C, ES:!addr16 ;11 F9 adrl adrh.
    // MOV X, ES:!addr16 ;11 D9 adrl adrh.
    switch (MI.getOperand(0).getReg()) {
    case RL78::R0:
      Bits = 0x11D90000;
      break;
    case RL78::R1:
      Bits = 0x118F0000;
      break;
    case RL78::R2:
      Bits = 0x11F90000;
      break;
    case RL78::R3:
      Bits = 0x11E90000;
      break;
    }
    unsigned int addressValue = getTargetOpValue(
        MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }

