ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
  case RL78::STORE8_esmemDE_r:
  case RL78::STORE8_esmemHL_a:
  case RL78::STORE8_esmemDEi_a:
  case RL78::STORE8_esmemHLi_a:
  case RL78::STORE8_esrborci_r:
  case RL78::STORE8_esrpi_r: {

    RL78ReportError(MI.getOperand(3).getReg() == RL78::R1,
                    "Instruction using illegal register.");

    unsigned int RegOp = MI.getOperand(1).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Instruction using illegal register.");

    if (MI.getOperand(2).isImm() && MI.getOperand(2).getImm() == 0 &&
        RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {
      // MOV es:[HL], A         11 9B.
      // MOV es:[DE], A         11 99.
      Bits = (RegOp == RL78::RP4) ? 0x1199 : 0x119B;
      Size = 2;
      break;
    }

    if (RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {
      // MOV es:[DE+byte], A    11 9A adr.
      // MOV es:[HL+byte], A    11 9C adr.
      Bits = (RegOp == RL78::RP4) ? 0x119A00 : 0x119C00;
      unsigned int addr = getTargetOpValue(MI, 2, 2, Fixups, STI,
                                           (MCFixupKind)RL78::fixup_RL78_DIR8U);
      Bits |= addr & 0xFF;
      Size = 3;
      break;
    } else {

      // MOV es:word[BC], A     11 48 adrl adrh.
      // MOV ES:word[C], A	  11 28 adrl adrh.
      // MOV ES : word[B], A    11 18 adrl adrh.
      if (RegOp == RL78::RP2)
        Bits = 0x11480000;
      else if (RegOp == RL78::R2)
        Bits = 0x11280000;
      else if (RegOp == RL78::R3)
        Bits = 0x11180000;
      Size = 4;
      unsigned int addressValue = getTargetOpValue(
          MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
      unsigned int laddr = (0x00FF & addressValue) << 8;
      unsigned int uaddr = (0xFF00 & addressValue) >> 8;
      Bits |= (uaddr | laddr);
      break;
    }
  }
  case RL78::LOAD8_a_esmemDE:
  case RL78::LOAD8_rp_esmemHL:
  case RL78::LOAD8_a_esmemDEi:
  case RL78::LOAD8_a_esmemHLi:
  case RL78::LOAD8_a_esrborci:
  case RL78::LOAD8_r_esrpi: {

    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");

    unsigned int RegOp = MI.getOperand(2).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Instruction using illegal register.");

    if (MI.getOperand(3).isImm() && MI.getOperand(3).getImm() == 0 &&
        RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {

      // MOV A, es:[DE]       11 89.
      // MOV A, es:[HL]       11 8B.
      Bits = (RegOp == RL78::RP4) ? 0x1189 : 0x118B;
      Size = 2;
      break;
    }

    if (RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {
      // MOV A, es:[DE+byte]  11 8A adr.
      // MOV A, es:[HL+byte]  11 8C adr.
      Bits = (RegOp == RL78::RP4) ? 0x118A00 : 0x118C00;
      unsigned int addr = getTargetOpValue(MI, 3, 2, Fixups, STI,
                                           (MCFixupKind)RL78::fixup_RL78_DIR8U);
      Bits |= addr & 0xFF;
      Size = 3;
      break;
    }
    if (RegOp == RL78::RP2)
      Bits = 0x11490000;
    else if (RegOp == RL78::R2)
      Bits = 0x11290000;
    else if (RegOp == RL78::R3)
      Bits = 0x11090000;

    Size = 4;
    // MOV A, es:word[BC]   11 49 adrl adrh.
    // MOV A, ES:word[C] ;11 29 adrl adrh.
    // MOV A, ES:word[B] ;11 09 adrl adrh.

    unsigned int addressValue = getTargetOpValue(
        MI, 3, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }

  case RL78::STORE8_esmemDEi_imm:
  case RL78::STORE8_esmemHLi_imm:
  case RL78::STORE8_esmemBorCi_imm:
  case RL78::STORE8_esmemBCi_imm: {
    unsigned int RegOp = MI.getOperand(1).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Instruction using illegal register.");

    if (RegOp != RL78::RP2 && RegOp != RL78::R2 && RegOp != RL78::R3) {

      // MOV ES:[DE+byte], #byte ;11 CA adr data.
      // MOV ES:[HL+byte], #byte ;11 CC adr data.
      Bits = (RegOp == RL78::RP4) ? 0x11CA0000 : 0x11CC0000;
      unsigned int addr = getTargetOpValue(MI, 2, 3, Fixups, STI,
                                           (MCFixupKind)RL78::fixup_RL78_DIR8U);
      Bits |= (addr & 0xFF) << 8;
      unsigned int data = getTargetOpValue(MI, 3, 2, Fixups, STI,
                                           (MCFixupKind)RL78::fixup_RL78_DIR8U);
      Bits |= (data & 0xFF);
      Size = 4;
      break;
    } else {

      // MOV ES:word[BC], #byte  ;11 39 adrl adrh data.
      // MOV ES:word[B],  #byte  ;11 19 adrl adrh data.
      // MOV ES:word[C],  #byte  ;11 38 adrl adrh data.
      if (RegOp == RL78::RP2)
        Bits = 0x1139000000;
      else if (RegOp == RL78::R2)
        Bits = 0x1138000000;
      else if (RegOp == RL78::R3)
        Bits = 0x1119000000;
      Size = 5;
      unsigned int addressValue = getTargetOpValue(
          MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
      unsigned int laddr = (0x00FF & addressValue) << 16;
      unsigned int uaddr = (0xFF00 & addressValue);
      Bits |= (uaddr | laddr);

      Bits |= getTargetOpValue(MI, 3, 4, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;

      break;
    }
  }
  case RL78::LOAD8_a_esmemRpr: {
    // MOV A, ES:[HL+B] ;11 61 C9.
    // MOV A, ES:[HL+C] ;11 61 E9.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(3).getReg() == RL78::R3) ? 0x1161C9 : 0x1161E9;

    break;
  }
  case RL78::STORE8_esmemRpr_a: {
    // MOV ES:[HL+B], A ;11 61 D9.
    // MOV ES:[HL+C], A ;11 61 F9.
    RL78ReportError(MI.getOperand(3).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(2).getReg() == RL78::R3) ? 0x1161D9 : 0x1161F9;
    break;
  }
  case RL78::XCH_A_X:
  case RL78::XCH_A_r:
    // XCH A, X          08
    // XCH A, C          61 8A
    // XCH A, B          61 8B
    // XCH A, E          61 8C
    // XCH A, D          61 8D
    // XCH A, L          61 8E
    // XCH A, H          61 8F
    if (MI.getOperand(3).getReg() == RL78::R0) {
      Size = 1;
      Bits = 0x08;
    } else
      Bits += (MI.getOperand(3).getReg() - RL78::R2);
    break;
  case RL78::XCH_A_sfr: {
    // XCH A, sfr      61 AB sfr.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(1).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "Instruction using illegal operand");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::XCH_A_sfrReg: {
    // XCH A, sfr      61 AB sfr.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    Bits |= (sfrRegisterToSfraddr[MI.getOperand(1).getReg()] & 0xFF);
    break;
  }
  case RL78::XCH_A_saddrabs: {
    // XCH A, saddr      61 A8 saddr.
    unsigned int addr = getTargetOpValue(
        MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::XCH_A_abs16: {
    // XCH A, !addr16    61 AA adrl adrh.
    unsigned int addressValue = getTargetOpValue(
        MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::XCH_A_memri: {

