ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
    // XCH A, [DE]       61 AE.
    // XCH A, [DE+byte]  61 AF adr.
    // XCH A, [HL]       61 AC.
    // XCH A, [HL+byte]  61 AD adr.
    unsigned int RegOp = MI.getOperand(2).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6,
                    "Instruction using illegal register.");

    if (MI.getOperand(3).isImm() && MI.getOperand(3).getImm() == 0) {

      Bits = (RegOp == RL78::RP4) ? 0x61AE : 0x61AC;
      Size = 2;
      break;
    } else {
      Bits = (RegOp == RL78::RP4) ? 0x61AF00 : 0x61AD00;
      unsigned int addr = getTargetOpValue(MI, 3, 2, Fixups, STI,
                                           (MCFixupKind)RL78::fixup_RL78_DIR8U);
      Bits |= addr & 0xFF;
      Size = 3;
      break;
    }
  }
  case RL78::XCH_A_memrr: {
    // XCH A, [HL+B]     61 B9.
    // XCH A, [HL+C]     61 A9.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::R2 || MI.getOperand(3).getReg() == RL78::R3,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(3).getReg() == RL78::R3) ? 0x61B9 : 0x61A9;
    break;
  }
  case RL78::XCH_A_esaddr16: {
    // XCH A, ES:!addr16 ;11 61 AA adrl adrh.
    unsigned int addressValue = getTargetOpValue(
        MI, 3, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::XCH_A_esmemDE:
  case RL78::XCH_A_esmemHL:
  case RL78::XCH_A_esmemRpi: {
    // XCH A, ES:[DE] ;11 61 AE.
    // XCH A, ES:[HL] ;11 61 AC.
    // XCH A, ES:[DE+byte] ;11 61 AF adr.
    // XCH A, ES:[HL+byte] ;11 61 AD adr.
    unsigned int RegOp = MI.getOperand(3).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6,
                    "Instruction using illegal register.");

    if (MI.getOperand(4).isImm() && MI.getOperand(4).getImm() == 0) {

      Bits = (RegOp == RL78::RP4) ? 0x1161AE : 0x1161AC;
      Size = 3;
      break;
    } else {
      Bits = (RegOp == RL78::RP4) ? 0x1161AF00 : 0x1161AD00;
      unsigned int addr = getTargetOpValue(MI, 4, 3, Fixups, STI,
                                           (MCFixupKind)RL78::fixup_RL78_DIR8U);
      Bits |= addr & 0xFF;
      Size = 4;
      break;
    }
  }
  case RL78::XCH_A_esmemRpr: {
    // XCH A, ES:[HL+B] ;11 61 B9
    // XCH A, ES:[HL+C] ;11 61 A9
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(4).getReg() == RL78::R3) ? 0x1161B9 : 0x1161A9;
    break;
  }
  case RL78::ONEB_r: {
    // ONEB r            EX (X..B -> 0..3)
    Bits += (MI.getOperand(0).getReg() - RL78::R0);
    break;
  }
  case RL78::ONEB_saddr: {

    // ONEB saddr        E4 saddr
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::ONEB_esaddr16: {

    // ONEB ES:!addr16    11 E5 adrl adrh
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::CLRB_r: {
    // CLRB r            FX (X..C -> 0..3)
    Bits |= (MI.getOperand(0).getReg() - RL78::R0);
    break;
  }
  case RL78::CLRB_saddr: {

    // CLRB saddr        F4 saddr
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::CLRB_esaddr16: {

    // CLRB ES:!addr16    11 F5 adrl adrh
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::INCW_saddr:
  case RL78::DECW_saddr: {
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8UW_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::DEC_saddr:
  case RL78::INC_saddr: {
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::INC_r:
  case RL78::DEC_r:
    // INC r             80 (X..H -> 0..7)
    // DEC r             90 (X..H -> 0..7)
    Bits += MI.getOperand(0).getReg() - RL78::R0;
    break;
  case RL78::CLRB_abs16:
  case RL78::ONEB_abs16: {
    // CLRB addr16       F5 adrl adrh
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::MOVS_memri_r: {

    // MOVS [HL+byte], X     61 CE adr
    RL78ReportError(MI.getOperand(2).getReg() == RL78::R0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  }
  case RL78::MOVS_Esmemri_r: {

    // MOVS ES:[HL+byte], X ;11 61 CE adr
    RL78ReportError(MI.getOperand(3).getReg() == RL78::R0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 2, 3, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  }
  case RL78::MOVW_rp_imm:
  case RL78::HI16_rp_addr:
    // MOVW AX, #word        30 datal datah
    // MOVW BC, #word        32 datal datah
    // MOVW DE, #word        34 datal datah
    // MOVW HL, #word        36 datal datah
    Bits += (((MI.getOperand(0).getReg() - RL78::RP0) * 2) << 16);
    // Note that fixup_RL78_DIR16U might be replaced with others if TargetFlag
    // says so
    if (MI.getOperand(1).isImm()) {
      unsigned int data = getTargetOpValue(
          MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U);
      Bits |= ((data & 0xFF00) >> 8) | ((data & 0xFF) << 8);
    } else
      getTargetOpValue(MI, 1, Size - 2, Fixups, STI,
                       (MCFixupKind)RL78::fixup_RL78_DIR16U);
    break;
  case RL78::MOVW_sp_rp:
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    break;
  case RL78::MOVW_sp_imm:
    // MOVW SP, #word    CB F8 datal datah
    if (MI.getOperand(1).isImm()) {
      // Not sure why CCRL does not enforce even values.
      unsigned int data = getTargetOpValue(
          MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U);
      Bits |= ((data & 0xFF00) >> 8) | ((data & 0xFF) << 8);

    } else {

      getTargetOpValue(MI, 1, Size - 2, Fixups, STI,
                       (MCFixupKind)RL78::fixup_RL78_DIR16U);
    }
    break;
  case RL78::MOVW_AX_sfrp: {
    // MOVW AX, sfrp ;AE sfr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(1).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF &&
                        immediateValue % 2 == 0,
                    "Instruction using illegal operand");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::MOVW_AX_sfrpReg: {
    // MOVW AX, sfrp ;AE sfr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    Bits |= sfrRegisterToSfraddr[MI.getOperand(1).getReg()] & 0xFF;
    break;
  }
  case RL78::LOAD16_rp_saddrp: {
    // MOVW AX, saddrp    AD saddr
    switch (MI.getOperand(0).getReg()) {
    case RL78::RP0:
      Bits = 0xAD00;
      break;
    case RL78::RP2:
      Bits = 0xDA00;
      break;
    case RL78::RP4:
      Bits = 0xEA00;
      break;
    case RL78::RP6:
      Bits = 0xFA00;
      break;
    default:
      llvm_unreachable("Invalid register used in MOVW instruction!");
    }
    unsigned int addr = getTargetOpValue(
        MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8UW_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::MOVW_sfrp_AX: {
    // MOVW sfrp, AX ;BE sfr
    RL78ReportError(MI.getOperand(0).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(0).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF &&
                        immediateValue % 2 == 0,
                    "Instruction using illegal operand");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::STORE16_saddrp_rp: {
    // MOVW saddrp, AX    BD saddr
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8UW_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::MOVW_sfrpReg_AX: {
    // MOVW sfrp, AX ;BE sfr
    Bits |= sfrRegisterToSfraddr[MI.getOperand(0).getReg()] & 0xFF;
    break;
  }
  case RL78::MOVW_sfrp_imm: {
    RL78ReportError(MI.getOperand(0).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(0).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF &&
                        immediateValue % 2 == 0,
                    "Instruction using illegal operand");
    Bits |= (immediateValue & 0xFF) << 16;
    unsigned int data = getTargetOpValue(MI, 1, 2, Fixups, STI,
                                         (MCFixupKind)RL78::fixup_RL78_DIR16U);
    unsigned int datal = (0x00FF & data) << 8;
    unsigned int datah = (0xFF00 & data) >> 8;
    Bits |= (datal | datah);
    break;
  }
  case RL78::MOVW_saddrp_imm: {

