ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
    // MOVW saddrp, #word    C9 saddr datal datah
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8UW_SAD);
    Bits |= (addr & 0xFF) << 16;
    unsigned int data = getTargetOpValue(MI, 1, 2, Fixups, STI,
                                         (MCFixupKind)RL78::fixup_RL78_DIR16U);
    unsigned int datal = (0x00FF & data) << 8;
    unsigned int datah = (0xFF00 & data) >> 8;
    Bits |= (datal | datah);
    break;
  }
  case RL78::MOVW_sfrpReg_imm: {
    // MOVW sfrp,#word ;CB sfr datal datah
    Bits |= (sfrRegisterToSfraddr[MI.getOperand(0).getReg()] & 0xFF) << 16;
    unsigned int data = getTargetOpValue(MI, 1, 2, Fixups, STI,
                                         (MCFixupKind)RL78::fixup_RL78_DIR16U);
    unsigned int datal = (0x00FF & data) << 8;
    unsigned int datah = (0xFF00 & data) >> 8;
    Bits |= (datal | datah);
    break;
  }
  case RL78::MOVW_AX_rp:
    // First/Only byte: BC -> 0x13, DE -> 0x15, HL -> 0x17.
    RL78ReportError(MI.getOperand(1).getReg() != MI.getOperand(0).getReg(),
                    "Invalid Instruction.");
    Bits += (MI.getOperand(1).getReg() - RL78::RP2) * 2;
    break;
  case RL78::MOVW_rp_AX:
    // MOVW BC, AX       12
    // MOVW DE, AX       14
    // MOVW HL, AX       16
    RL78ReportError(MI.getOperand(1).getReg() != MI.getOperand(0).getReg(),
                    "Invalid Instruction.");
    Bits += (MI.getOperand(0).getReg() - RL78::RP2) * 2;
    break;
  case RL78::LOAD16_rp_abs16: {
    // MOVW AX, !addr16      AF adrl adrh
    // MOVW BC, !addr16      DB adrl adrh
    // MOVW DE, !addr16      EB adrl adrh
    // MOVW HL, !addr16      FB adrl adrh
    if (MI.getOperand(0).getReg() != RL78::RP0) {
      Bits &= 0x00FFFF;
      Bits |= 0xDB0000 + ((MI.getOperand(0).getReg() - RL78::RP2) << 20);
    }
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16UW_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits = Bits + laddr + uaddr;
    break;
  }
  case RL78::STORE16_abs16_rp: {
    // MOVW !addr16, AX      BF adrl adrh
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16UW_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits = Bits + laddr + uaddr;

    break;
  }
  case RL78::LOAD16_rp_esmemDE:
  case RL78::LOAD16_rp_esmemHL:
  case RL78::LOAD16_rp_esmemDEi:
  case RL78::LOAD16_rp_esmemHLi:
  case RL78::LOAD16_rp_esrpi:
  case RL78::LOAD16_rp_esrbci: {
    // MOVW AX, es:[DE]       11 A9
    // MOVW AX, es:[DE+byte]  11 AA adr
    // MOVW AX, es:[HL]       11 AB
    // MOVW AX, es:[HL+byte]  11 AC adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int RegOp = MI.getOperand(2).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Instruction using illegal register.");

    if (RegOp != RL78::RP2 && RegOp != RL78::R3 && RegOp != RL78::R2) {
      Size = 3;
      // Size is set to 3 update it.
      if (MI.getOperand(3).isImm())
        Size = MI.getOperand(3).getImm() ? 3 : 2;
      else
        Size = 3;

      if (RegOp == RL78::RP4) {
        if (Size == 2) {
          Bits = 0x11A9;
        } else {
          Bits = 0x11AA00;
          Bits |= getTargetOpValue(MI, 3, 2, Fixups, STI,
                                   (MCFixupKind)RL78::fixup_RL78_DIR8U) &
                  0xFF;
        }
      }

      else {
        if (Size == 2) {

          Bits = 0x11AB;
        } else {
          Bits = 0x11AC00;
          Bits |= getTargetOpValue(MI, 3, 2, Fixups, STI,
                                   (MCFixupKind)RL78::fixup_RL78_DIR8U) &
                  0xFF;
        }
      }

    }
    // MOVW AX, es:word[BC]   11 79 adrl adrh
    else {
      // MOVW AX, es:word[BC]   11 79 adrl adrh
      if (RegOp == RL78::RP2)
        Bits = 0x11790000;
      else if (RegOp == RL78::R2)
        Bits = 0x11690000;
      else if (RegOp == RL78::R3)
        Bits = 0x11590000;
      Size = 4;
      unsigned int addressValue = getTargetOpValue(
          MI, 3, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
      Bits |= (((addressValue)&0xFF00) >> 8) | ((addressValue & 0xFF) << 8);
    }
    break;
  }
  case RL78::LOAD16_rp_memDE:
  case RL78::LOAD16_rp_memHL:
  case RL78::LOAD16_rp_memDEi:
  case RL78::LOAD16_rp_memHLi:
  case RL78::LOAD16_rp_rpi:
  case RL78::LOAD16_rp_rbci: {

    // MOVW AX, [DE]       A9
    // MOVW AX, [DE+byte]  AA adr
    // MOVW AX, [HL]       AB
    // MOVW AX, [HL+byte]  AC adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");

    unsigned int RegOp = MI.getOperand(1).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Instruction using illegal register.");

    if (RegOp != RL78::RP2 && RegOp != RL78::R3 && RegOp != RL78::R2) {
      // Size is set to 3 update it.
      if (MI.getOperand(2).isImm())
        Size = MI.getOperand(2).getImm() ? 2 : 1;
      else
        Size = 2;

      if (RegOp == RL78::RP4) {
        if (Size == 1) {
          Bits = 0xA9;
        } else {
          Bits = 0xAA00;
          Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                                   (MCFixupKind)RL78::fixup_RL78_DIR8U) &
                  0xFF;
        }
      }

      else {
        if (Size == 1) {

          Bits = 0xAB;
        } else {
          Bits = 0xAC00;
          Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                                   (MCFixupKind)RL78::fixup_RL78_DIR8U) &
                  0xFF;
        }
      }
    }
    // MOVW AX, word[BC]   79 adrl adrh
    else {
      if (RegOp == RL78::RP2)
        Bits = 0x790000;
      else if (RegOp == RL78::R2)
        Bits = 0x690000;
      else if (RegOp == RL78::R3)
        Bits = 0x590000;

      Size = 3;
      unsigned int addressValue = getTargetOpValue(
          MI, 2, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
      Bits |= ((addressValue & 0xFF00) >> 8) | ((addressValue & 0xFF) << 8);
    }
    break;
  }
  case RL78::STORE16_memDE_rp:
  case RL78::STORE16_memHL_rp:
  case RL78::STORE16_memDEi_rp:
  case RL78::STORE16_memHLi_rp:
  case RL78::STORE16_rpi_rp:
  case RL78::STORE16_rbci_rp: {
    // MOVW [DE], AX         B9
    // MOVW [DE+byte], AX    BA adr
    // MOVW [HL], AX         BB
    // MOVW [HL+byte], AX    BC adr
    // MOVW word[BC], AX     78 adrl adrh
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int RegOp = MI.getOperand(0).getReg();
    RL78ReportError(RegOp == RL78::RP4 || RegOp == RL78::RP6 ||
                        RegOp == RL78::RP2 || RegOp == RL78::R2 ||
                        RegOp == RL78::R3,
                    "Instruction using illegal register.");

    if (RegOp != RL78::RP2 && RegOp != RL78::R3 && RegOp != RL78::R2) {
      // Size is set to 3 update it.
      if (MI.getOperand(1).isImm())
        Size = MI.getOperand(1).getImm() ? 2 : 1;
      else
        Size = 2;

      if (RegOp == RL78::RP4) {
        if (Size == 1) {
          Bits = 0xB9;
        } else {
          Bits = 0xBA00;
          Bits |= getTargetOpValue(MI, 1, 1, Fixups, STI,
                                   (MCFixupKind)RL78::fixup_RL78_DIR8U) &
                  0xFF;
        }
      }

      else {
        if (Size == 1) {

          Bits = 0xBB;
        } else {
          Bits = 0xBC00;
          Bits |= getTargetOpValue(MI, 1, 1, Fixups, STI,
                                   (MCFixupKind)RL78::fixup_RL78_DIR8U) &
                  0xFF;
        }
      }

