ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
    }
    // MOVW word[BC], AX     78 adrl adrh
    else {
      if (RegOp == RL78::RP2)
        Bits = 0x780000;
      else if (RegOp == RL78::R2)
        Bits = 0x680000;
      else if (RegOp == RL78::R3)
        Bits = 0x580000;
      Size = 3;
      unsigned int addressValue = getTargetOpValue(
          MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
      Bits |= ((addressValue & 0xFF00) >> 8) | ((addressValue & 0xFF) << 8);
    }
    break;
  }
  case RL78::STORE16_esmemDE_rp:
  case RL78::STORE16_esmemHL_rp:
  case RL78::STORE16_esmemDEi_rp:
  case RL78::STORE16_esmemHLi_rp:
  case RL78::STORE16_esrpi_rp:
  case RL78::STORE16_esrbci_rp:
    // MOVW es:[DE], AX         11 B9
    // MOVW es:[DE+byte], AX    11 BA adr
    // MOVW es:[HL], AX         11 BB
    // MOVW es:[HL+byte], AX    11 BC adr
    // MOVW es:word[BC], AX     11 78 adrl adrh
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    if (MI.getOperand(1).getReg() != RL78::RP2 &&
        MI.getOperand(1).getReg() != RL78::R3 &&
        MI.getOperand(1).getReg() != RL78::R2) {
      // Size is set to 3 update it.
      if (MI.getOperand(2).isImm())
        Size = MI.getOperand(2).getImm() ? 3 : 2;
      else
        Size = 3;

      if (MI.getOperand(1).getReg() == RL78::RP4) {
        if (Size == 2) {
          Bits = 0x11B9;
        } else {
          Bits = 0x11BA00;
          Bits |= getTargetOpValue(MI, 2, 2, Fixups, STI,
                                   (MCFixupKind)RL78::fixup_RL78_DIR8U) &
                  0xFF;
        }
      }

      else {
        if (Size == 2) {
          Bits = 0x11BB;
        } else {
          Bits = 0x11BC00;
          Bits |= getTargetOpValue(MI, 2, 2, Fixups, STI,
                                   (MCFixupKind)RL78::fixup_RL78_DIR8U) &
                  0xFF;
        }
      }
    }
    // MOVW es:word[BC], AX     11 78 adrl adrh
    else {
      if (MI.getOperand(1).getReg() == RL78::RP2)
        Bits = 0x11780000;
      else if (MI.getOperand(1).getReg() == RL78::R2)
        Bits = 0x11680000;
      else if (MI.getOperand(1).getReg() == RL78::R3)
        Bits = 0x11580000;
      Size = 4;
      unsigned int addressValue = getTargetOpValue(
          MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
      Bits |= ((addressValue & 0xFF00) >> 8) | ((addressValue & 0xFF) << 8);
    }
    break;
  case RL78::LOAD16_rp_stack_slot:
    // MOVW AX, [SP+byte]    A8 adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::STORE16_stack_slot_rp:
    // MOVW [SP+byte], AX    B8 adr
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 1, 1, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::LOAD16_rp_esaddr16: {
    // MOVW AX, ES:!addr16   ;11 AF adrl adrh
    // MOVW BC, ES:!addr16   ;11 DB adrl adrh
    // MOVW DE, ES:!addr16   ;11 EB adrl adrh
    // MOVW HL, ES:!addr16   ;11 FB adrl adrh
    switch (MI.getOperand(0).getReg()) {
    case RL78::RP0:
      break;
    case RL78::RP2:
      Bits = 0x11DB0000;
      break;
    case RL78::RP4:
      Bits = 0x11EB0000;
      break;
    case RL78::RP6:
      Bits = 0x11FB0000;
      break;
    default:
      llvm_unreachable("Invalid register used in MOVW instruction!");
    }
    unsigned int addressValue = getTargetOpValue(
        MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16UW_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits = Bits + laddr + uaddr;
    break;
  }
  case RL78::STORE16_esaddr16_rp: {

    // MOVW ES:!addr16, AX   ;11 BF adrl adrh
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20UW_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits = Bits + laddr + uaddr;
    break;
  }
  case RL78::MOVW_AX_sp:
  case RL78::MOVW_rp_sp:
    // MOVW AX, SP       AE F8
    // MOVW BC, SP       DB adrl adrh
    // MOVW DE, SP       EB adrl adrh
    // MOVW HL, SP       FB adrl adrh
    if (MI.getOperand(0).getReg() == RL78::RP0) {
      Size = 2;
      Bits = 0xAEF8;
    } else {
      Bits = 0xDBF8FF;
      Size = 3;
      Bits += (MI.getOperand(0).getReg() - RL78::RP2) << 20;
    }
    break;
  case RL78::ONEW_rp:
  case RL78::CLRW_rp:
    // AX -> x6, BC -> x7.
    Bits |= (MI.getOperand(0).getReg() == RL78::RP0) ? 0 : 1;
    break;
  case RL78::XCHW_AX_rp:
    // XCHW AX, BC   33
    // XCHW AX, DE   35
    // XCHW AX, HL   37
    Bits += (MI.getOperand(1).getReg() - RL78::RP2) * 2;
    break;
  case RL78::BSWAP32_rp:
    // Same as XCHW_AX_rp + 2 x XCH A, X.
    Bits += ((MI.getOperand(1).getReg() - RL78::RP2) * 2) << 8;
    break;
  case RL78::ADD_r_r:
    // ADD A, r          61 0r (X -> 8, C -> A ... H -> F)
    // ADD X, A          61 0r (X -> 0, A -> 1 ... H -> 7)
    encode8BitRROperationInstruction(MI, Bits, 0x6100, 0x0B00);
    break;
  case RL78::ADDC_r_r:
    // ADDC A, r          61 1r (X -> 8, C -> A ... H -> F)
    // ADDC r, A          61 1r (X -> 0, A -> 1 ... H -> 7)
    encode8BitRROperationInstruction(MI, Bits, 0x6110, 0x1B00);
    break;
  case RL78::SUB_r_r:
    // SUB A, r          61 2r (X -> 8, C -> A ... H -> F)
    // SUB X, A          61 2r (X -> 0, A -> 1 ... H -> 7)
    encode8BitRROperationInstruction(MI, Bits, 0x6120, 0x2B00);
    break;
  case RL78::SUBC_r_r:
    // SUBC A, r          61 3r (X -> 8, C -> A ... H -> F)
    // SUBC X, A          61 3r (X -> 0, A -> 1 ... H -> 7)
    encode8BitRROperationInstruction(MI, Bits, 0x6130, 0x3B00);
    break;
  case RL78::AND_r_r:
    // AND A, r          61 5r (X -> 8, C -> A ... H -> F)
    // AND X, A          61 5r (X -> 0, A -> 1 ... H -> 7)
    encode8BitRROperationInstruction(MI, Bits, 0x6150, 0x5B00);
    break;
  case RL78::OR_r_r:
    // OR A, r          61 6r (X -> 8, C -> A ... H -> F)
    // OR X, A          61 6r (X -> 0, A -> 1 ... H -> 7)
    encode8BitRROperationInstruction(MI, Bits, 0x6160, 0x6B00);
    break;
  case RL78::XOR_r_r:
    // XOR A, r          61 7r (X -> 8, C -> A ... H -> F)
    // XOR X, A          61 7r (X -> 0, A -> 1 ... H -> 7)
    encode8BitRROperationInstruction(MI, Bits, 0x6170, 0x7B00);
    break;
  case RL78::CMP_r_r:
    // CMP A, r              61 4r (X -> 8, C -> A ... H -> F)
    // CMP r, A              61 40 (X -> 0, A -> 1 ... H -> 7)
    encode8BitCMPOperationInstruction(MI, Bits, 0x6140, 0x4B00);
    break;
  case RL78::ADD_r_imm:
    // ADD A, #byte      0C data
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::ADDC_A_imm:
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::SUB_r_imm:
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::SUBC_A_imm:
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::AND_r_imm:
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::OR_r_imm:
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
  case RL78::XOR_r_imm:
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::CMP_r_imm:
      Bits |= getTargetOpValue(MI, 1, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::ADD_r_abs16:
  case RL78::ADDC_r_abs16:
  case RL78::SUB_r_abs16:
  case RL78::SUBC_r_abs16:
  case RL78::AND_r_abs16:
  case RL78::OR_r_abs16:
  case RL78::XOR_r_abs16: {
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 2, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::CMP_r_abs16: {
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }

