ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
  case RL78::CMP_abs16_imm: {

    // CMP !addr16, #byte    40 adrl adrh data
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 16;
    unsigned int uaddr = (0xFF00 & addressValue);
    Bits |= (uaddr | laddr);
    Bits |= getTargetOpValue(MI, 1, 3, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  }
  case RL78::ADD_r_memHL:
  case RL78::ADD_r_memri:
    // ADD A, [HL]       0D
    // ADD A, [HL+byte]  0E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    encode8BitRMEMRIOperationInstruction(MI, Bits, Size, 0x0D, 0x0E00);
    if (Size == 2)
      Bits |= getTargetOpValue(MI, 3, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;

    break;
  case RL78::ADDC_r_memHL:
  case RL78::ADDC_r_memri:
    // ADDC A, [HL]       0D
    // ADDC A, [HL+byte]  0E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    encode8BitRMEMRIOperationInstruction(MI, Bits, Size, 0x1D, 0x1E00);
    if (Size == 2)
      Bits |= getTargetOpValue(MI, 3, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::SUB_r_memHL:
  case RL78::SUB_r_memri:
    // SUB A, [HL]       2D
    // SUB A, [HL+byte]  2E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    encode8BitRMEMRIOperationInstruction(MI, Bits, Size, 0x2D, 0x2E00);
    if (Size == 2)
      Bits |= getTargetOpValue(MI, 3, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::SUBC_r_memHL:
  case RL78::SUBC_r_memri:
    // SUBC A, [HL]       3D
    // SUBC A, [HL+byte]  3E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    encode8BitRMEMRIOperationInstruction(MI, Bits, Size, 0x3D, 0x3E00);
    if (Size == 2)
      Bits |= getTargetOpValue(MI, 3, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::AND_r_memHL:
  case RL78::AND_r_memri:
    // AND A, [HL]       5D
    // AND A, [HL+byte]  5E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    encode8BitRMEMRIOperationInstruction(MI, Bits, Size, 0x5D, 0x5E00);
    if (Size == 2)
      Bits |= getTargetOpValue(MI, 3, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::OR_r_memHL:
  case RL78::OR_r_memri:
    // OR A, [HL]        6D
    // OR A, [HL+byte]   6E adr
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    encode8BitRMEMRIOperationInstruction(MI, Bits, Size, 0x6D, 0x6E00);
    if (Size == 2)
      Bits |= getTargetOpValue(MI, 3, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::XOR_r_memHL:
  case RL78::XOR_r_memri:
    // XOR A, [HL]       7D
    // XOR A, [HL+byte]  7E adr
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    encode8BitRMEMRIOperationInstruction(MI, Bits, Size, 0x7D, 0x7E00);
    if (Size == 2)
      Bits |= getTargetOpValue(MI, 3, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    break;
  case RL78::CMP_r_memHL:
  case RL78::CMP_r_memri:
    // CMP A, [HL]           4D.
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    if (MI.getOperand(2).isImm() && MI.getOperand(2).getImm() == 0) {
      Size = 1;
      Bits = 0x4D;
    }
    // CMP A, [HL+byte]      4E adr.
    else {
      Size = 2;
      Bits = 0x4E00;
      Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;

  case RL78::ADD_r_memrr:
  case RL78::ADDC_r_memrr:
  case RL78::SUB_r_memrr:
  case RL78::SUBC_r_memrr:
  case RL78::AND_r_memrr:
  case RL78::OR_r_memrr:
  case RL78::XOR_r_memrr:
    // Opcode is of the form:
    // Op A, [HL+B]  61 X0
    // Op A, [HL+C]  61 X2.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::R2 || MI.getOperand(3).getReg() == RL78::R3,
                    "Instruction using illegal register.");
    if (MI.getOperand(3).getReg() == RL78::R2)
      Bits |= 2;
    break;
  case RL78::CMP_r_memrr:
    // Opcode is of the form:
    // Op A, [HL+B]  61 X0
    // Op A, [HL+C]  61 X2.
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::R2 || MI.getOperand(2).getReg() == RL78::R3,
                    "Instruction using illegal register.");
    if (MI.getOperand(2).getReg() == RL78::R2)
      Bits |= 2;
    break;
  case RL78::SUBC_r_esaddr16:
  case RL78::SUB_r_esaddr16:
  case RL78::AND_r_esaddr16:
  case RL78::OR_r_esaddr16:
  case RL78::XOR_r_esaddr16:
  case RL78::ADDC_r_esaddr16:
  case RL78::ADD_r_esaddr16: {

