ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
    // ADD A, ES:!addr16 ;11 0F adrl adrh
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 3, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits = Bits + laddr + uaddr;
    break;
  }
  case RL78::CMP_r_esaddr16: {
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits = Bits + laddr + uaddr;
    break;
  }

  case RL78::CMP0_esaddr16: {
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits = Bits + laddr + uaddr;
    break;
  }
  case RL78::ADD_r_esmemHL:
  case RL78::ADD_r_esmemHLi: {

    // ADD A, ES:[HL] ;11 0D
    // ADD A, ES:[HL+byte] ;11 0E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    if (MI.getOperand(4).isImm() && MI.getOperand(4).getImm() == 0) {
      Bits = 0x110D;
      Size = 2;
    } else {
      Bits = 0x110E00;
      Size = 3;
      Bits |= getTargetOpValue(MI, 4, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::ADDC_r_esmemHL:
  case RL78::ADDC_r_esmemHLi: {
    // ADDC A, ES:[HL] ;11 1D
    // ADDC A, ES:[HL+byte] ;11 1E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    if (MI.getOperand(4).isImm() && MI.getOperand(4).getImm() == 0) {
      Bits = 0x111D;
      Size = 2;
    } else {
      Bits = 0x111E00;
      Size = 3;
      Bits |= getTargetOpValue(MI, 4, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::SUB_r_esmemHL:
  case RL78::SUB_r_esmemHLi: {

    // SUB A, ES:[HL] ;11 2D
    // SUB A, ES:[HL+byte] ;11 2E adrdr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    if (MI.getOperand(4).isImm() && MI.getOperand(4).getImm() == 0) {
      Bits = 0x112D;
      Size = 2;
    } else {
      Bits = 0x112E00;
      Size = 3;
      Bits |= getTargetOpValue(MI, 4, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::SUBC_r_esmemHL:
  case RL78::SUBC_r_esmemHLi: {
    // SUBC A, ES:[HL] ;11 3D
    // SUBC A, ES:[HL+byte] ;11 3E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    if (MI.getOperand(4).isImm() && MI.getOperand(4).getImm() == 0) {
      Bits = 0x113D;
      Size = 2;
    } else {
      Bits = 0x113E00;
      Size = 3;
      Bits |= getTargetOpValue(MI, 4, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::AND_r_esmemHL:
  case RL78::AND_r_esmemHLi: {

    // ADD A, ES:[HL] ;11 0D
    // ADD A, ES:[HL+byte] ;11 0E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    if (MI.getOperand(4).isImm() && MI.getOperand(4).getImm() == 0) {
      Bits = 0x115D;
      Size = 2;
    } else {
      Bits = 0x115E00;
      Size = 3;
      Bits |= getTargetOpValue(MI, 4, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::OR_r_esmemHL:
  case RL78::OR_r_esmemHLi: {
    // OR A, ES:[HL] ;11 6D
    // OR A, ES:[HL+byte] ;11 6E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    if (MI.getOperand(4).isImm() && MI.getOperand(4).getImm() == 0) {
      Bits = 0x116D;
      Size = 2;
    } else {
      Bits = 0x116E00;
      Size = 3;
      Bits |= getTargetOpValue(MI, 4, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::XOR_r_esmemHL:
  case RL78::XOR_r_esmemHLi: {

    // XOR A, ES:[HL] ;11 7D
    // XOR A, ES:[HL+byte] ;11 7E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");

    if (MI.getOperand(4).isImm() && MI.getOperand(4).getImm() == 0) {
      Bits = 0x117D;
      Size = 2;
    } else {
      Bits = 0x117E00;
      Size = 3;
      Bits |= getTargetOpValue(MI, 4, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::CMP_r_esmemHL:
  case RL78::CMP_r_esmemHLi: {
    // CMP A, ES:[HL] ;11 4D
    // CMP A, ES:[HL+byte] ;11 4E adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");

    if (MI.getOperand(3).isImm() && MI.getOperand(3).getImm() == 0) {
      Bits = 0x114D;
      Size = 2;
    } else {
      Bits = 0x114E00;
      Size = 3;
      Bits |= getTargetOpValue(MI, 3, 2, Fixups, STI,
                               (MCFixupKind)RL78::fixup_RL78_DIR8U) &
              0xFF;
    }
    break;
  }
  case RL78::CMP_esaddr16_imm: {

    // CMP ES:!addr16, #byte ;11 40 adrl adrh data
    Bits |= getTargetOpValue(MI, 2, 4, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 16;
    unsigned int uaddr = (0xFF00 & addressValue);
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::CMPS_rp_memri: {
    // CMPS X, ES:[HL+byte] ;11 61 DE adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(MI, 3, 3, Fixups, STI,
                                         (MCFixupKind)RL78::fixup_RL78_DIR8U);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::ADDC_r_esmemRpr:
    // ADDC A, ES:[HL+C] ;11 61 92
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(4).getReg() == RL78::R3) ? 0x116190 : 0x116192;
    break;
  case RL78::ADD_r_esmemRpr:
    // ADD A, ES:[HL+C] ;11 61 82
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(4).getReg() == RL78::R3) ? 0x116180 : 0x116182;
    break;
  case RL78::SUB_r_esmemRpr:
    // SUB A, ES:[HL+C] ;11 61 A2
    RL78ReportError(MI.getOperand(1).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(4).getReg() == RL78::R3) ? 0x1161A0 : 0x1161A2;
    break;
  case RL78::SUBC_r_esmemRpr:
    // SUBC A, ES:[HL+C] ;11 61 B2
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(4).getReg() == RL78::R3) ? 0x1161B0 : 0x1161B2;
    break;
  case RL78::AND_r_esmemRpr:
    // AND A, ES:[HL+C] ;11 61 D2
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(4).getReg() == RL78::R3) ? 0x1161D0 : 0x1161D2;
    break;
  case RL78::OR_r_esmemRpr:
    // OR A, ES:[HL+C] ;11 61 E2
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(4).getReg() == RL78::R3) ? 0x1161E0 : 0x1161E2;
    break;
  case RL78::XOR_r_esmemRpr:
    // XOR A, ES:[HL+C] ;11 61 F2
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(4).getReg() == RL78::R3) ? 0x1161F0 : 0x1161F2;
    break;
  case RL78::CMP_r_esmemRpr:
    // CMP A, ES:[HL+C] ;11 61 C
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits = (MI.getOperand(3).getReg() == RL78::R3) ? 0x1161C0 : 0x1161C2;
    break;
  case RL78::CMP0_r:
    // CMP0 r                DX (X..B -> 0..3)
    RL78ReportError(MI.getOperand(0).getReg() < RL78::R4,
                    "Instruction using illegal register.");
    Bits |= (MI.getOperand(0).getReg() - RL78::R0);
    break;
  case RL78::CMP0_saddr: {
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= (addr & 0xFF);
    break;
  }
  case RL78::CMP0_abs16: {

