ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::CMPS_r_memri:
    // CMPS X, [HL+byte]     61 DE adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 2, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::ADDW_rp_imm:
  case RL78::SUBW_rp_imm: {
    // SUBW AX, #word        24 datal datah
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 2, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U);
    Bits |= ((addressValue & 0xFF00) >> 8) | ((addressValue & 0xFF) << 8);
    break;
  }
  case RL78::ADDW_rp_rp:
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    // ADDW  AX, AX          01
    // ADDW  AX, BC          03
    // ADDW  AX, DE          05
    // ADDW  AX, HL          07
    Bits += (MI.getOperand(2).getReg() - RL78::RP0) * 2;
    break;
  case RL78::SUBW_rp_rp:
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    // SUBW AX, BC           23
    // SUBW AX, DE           25
    // SUBW AX, HL           27
    Bits += (MI.getOperand(2).getReg() - RL78::RP2) * 2;
    break;
  case RL78::ADDW_rp_abs16:
  case RL78::SUBW_rp_abs16: {
    // ADDW  AX, !addr16     02 adrl adrh
    // SUBW  AX, !addr16     22 adrl adrh
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 2, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16UW_RAM);
    // getTargetOpValue(MI, 1, 1, Fixups, STI);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::CMPW_rp_abs16: {
    // CMPW  AX, !addr16     42 adrl adrh
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16UW_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::ADDW_rp_saddr:
  case RL78::SUBW_rp_saddr: {
    // ADDW  AX, saddrp      06 saddr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(
        MI, 2, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8UW_SAD);
    Bits |= (addr & 0xFF);
    break;
  }
  case RL78::CMPW_rp_saddr: {
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(
        MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8UW_SAD);
    Bits |= (addr & 0xFF);
    break;
  }

  case RL78::ADDW_rp_esaddr16:
  case RL78::SUBW_rp_esaddr16: {
    // ADDW AX, ES:!addr16 ;11 02 adrl adrh
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 3, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16UW_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::CMPW_rp_esaddr16: {
    // ADDW AX, ES:!addr16 ;11 02 adrl adrh
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16UW_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::ADDW_rp_esmemHLi: {
    // ADDW AX, ES:[HL+byte] ;11 61 09 adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(MI, 4, 3, Fixups, STI,
                                         (MCFixupKind)RL78::fixup_RL78_DIR8U);
    Bits |= (addr & 0xFF);
    break;
  }
  case RL78::SUBW_rp_esmemHLi: {
    // SUBW AX, ES:[HL+byte]
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(MI, 4, 3, Fixups, STI,
                                         (MCFixupKind)RL78::fixup_RL78_DIR8U);
    Bits |= (addr & 0xFF);
    break;
  }
  case RL78::CMPW_rp_esmemHLi: {
    // CMPW AX, ES:[HL+byte] ;11 61 49 adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(MI, 3, 3, Fixups, STI,
                                         (MCFixupKind)RL78::fixup_RL78_DIR8U);
    Bits |= (addr & 0xFF);
    break;
  }
  case RL78::CMPW_rp_rp:
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).getReg() != RL78::RP0,
                    "Instruction using illegal register.");
    // CMPW AX, BC           43
    // CMPW AX, DE           45
    // CMPW AX, HL           47
    Bits += (MI.getOperand(1).getReg() - RL78::RP2) * 2;
    break;
  case RL78::CMPW_rp_imm: {
    // CMPW AX, #word ;44 datal datah

    // Bits |= ((MI.getOperand(1).getImm() & 0xFF00) >> 8) |
    //        ((MI.getOperand(1).getImm() & 0xFF) << 8);
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::ADDW_rp_memri:
  case RL78::SUBW_rp_memri:
    // ADDW  AX, [HL+byte]   61 09 adr
    // SUBW AX, [HL+byte]    61 29 adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 3, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::CMPW_rp_memri:
    // CMPW AX, [HL+byte]  61 49 adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 2, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::INC_abs16:
  case RL78::DEC_abs16: {
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::INCW_abs16:
  case RL78::DECW_abs16: {
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16UW_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::INC_esaddr16:
  case RL78::DEC_esaddr16: {
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::INCW_esaddr16:
  case RL78::DECW_esaddr16: {
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20UW_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }

  case RL78::INC_memri:
  case RL78::DEC_memri:
  case RL78::INCW_memri:
  case RL78::DECW_memri:
    // INC [HL+byte]     61 59 adr
    // DEC [HL+byte]     61 69 adr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::INC_esmemHLi:
  case RL78::DEC_esmemHLi:
  case RL78::INCW_esmemHLi:
  case RL78::DECW_esmemHLi:
    // INC ES:[HL+byte] ;11 61 59 adr
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits |= getTargetOpValue(MI, 2, 3, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::INCW_rp:
  case RL78::DECW_rp:
    // INCW AX           A1
    // INCW BC           A3
    // INCW DE           A5
    // INCW HL           A7
    // DECW AX           B1
    // DECW BC           B3
    // DECW DE           B5
    // DECW HL           B7
    Bits += (MI.getOperand(0).getReg() - RL78::RP0) * 2;
    break;
  case RL78::SHR_r_i:
  case RL78::SAR_r_i:
    // SHR A, X          31 XA (X -> 1..7)
    // SAR A, X          31 XB (X -> 1..7)
    // Bits +=  getTargetOpValue(MI, 2, 3, Fixups, STI,
    // (MCFixupKind)RL78::fixup_RL78_DIR3U) & 0xFF << 4; //TODO??
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(2).getImm() << 4;
    break;
  case RL78::SHL_r_imm:
    // SHL A, X          31 X9 (X -> 1..7)
    // SHL B, X          31 X8 (X -> 1..7)
    // SHL C, X          31 X7 (X -> 1..7)
    RL78ReportError(MI.getOperand(0).getReg() >= RL78::R1 &&
                        MI.getOperand(0).getReg() <= RL78::R3,
                    "Instruction using illegal register.");
    Bits += (MI.getOperand(2).getImm() - 1) << 4;
    // Second byte: A -> x9, B -> x8, C -> x7.
    if (MI.getOperand(0).getReg() == RL78::R2) {
      Bits -= 2;
    } else if (MI.getOperand(0).getReg() == RL78::R3) {
      Bits -= 1;
    }
    break;
  case RL78::SHLW_rp_imm:
    // SHLW AX, X        31 XD (X -> 1..15)
    // SHLW BC, X        31 XC (X -> 1..15)
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP0 ||
                        MI.getOperand(1).getReg() == RL78::RP2,
                    "Instruction using illegal register.");
    Bits += (MI.getOperand(2).getImm() - 1) << 4;
    if (MI.getOperand(0).getReg() == RL78::RP2)
      --Bits;
    break;
  case RL78::SHRW_rp_i:
  case RL78::SARW_rp_i:
    // SHRW AX, 1        31 1E
    // SHRW AX, 2        31 2E
    // SHRW AX, 3        31 3E
    // SHRW AX, 4        31 4E
    // SHRW AX, 5        31 5E
    // SHRW AX, 6        31 6E
    // SHRW AX, 7        31 7E
    // SHRW AX, 8        31 8E
    // SHRW AX, 9        31 9E
    // SHRW AX, 10       31 AE
    // SHRW AX, 11       31 BE
    // SHRW AX, 12       31 CE
    // SHRW AX, 13       31 DE
    // SHRW AX, 14       31 EE
    // SHRW AX, 15       31 FE
    // SARW AX, 1        31 1F
    // SARW AX, 2        31 2F
    // SARW AX, 3        31 3F
    // SARW AX, 4        31 4F
    // SARW AX, 5        31 5F
    // SARW AX, 6        31 6F
    // SARW AX, 7        31 7F
    // SARW AX, 8        31 8F
    // SARW AX, 9        31 9F
    // SARW AX, 10       31 AF
    // SARW AX, 11       31 BF
    // SARW AX, 12       31 CF
    // SARW AX, 13       31 DF
    // SARW AX, 14       31 EF
    // SARW AX, 15       31 FF
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP0,
                    "Instruction using illegal register.");
    Bits += (MI.getOperand(2).getImm() - 1) << 4;
    break;
  case RL78::ROLWC_rp_1:
    // ROLWC AX, 1       61 EE
    // ROLWC BC, 1       61 FE
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP0 ||
                        MI.getOperand(1).getReg() == RL78::RP2,
                    "Instruction using illegal register.");
    if (MI.getOperand(0).getReg() == RL78::RP2)
      Bits += 0x10;
    break;
  case RL78::ROR_r_1:
  case RL78::ROL_r_1:
  case RL78::RORC_r_1:
  case RL78::ROLC_r_1:
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    break;
  case RL78::MOV1_r_cy:
    // MOV1 A.X, CY          71 X9 (X -> 0..7 -> 8..F)
    encodeBitManip1RInstruction(MI, Bits, 0x7189, 2);
    break;
  case RL78::SET1_A:
    // SET1 A.X              71 Xa (X -> 0..7 -> 8..F)
    encodeBitManip1RInstruction(MI, Bits, 0x718A, 2);
    break;
  case RL78::CLR1_A:
    // CLR1 A.X              71 XB (X -> 0..7 -> 8..F)
    encodeBitManip1RInstruction(MI, Bits, 0x718B, 2);
    break;
  case RL78::AND1_cy_A:
  case RL78::AND1_cy_r:
    // AND1 CY, A.X          71 XD (X -> 0..7 -> 8..F)
    // AND1 CY, saddr.X      71 X5 saddr (X -> 0..7)
    encodeBitManip1RInstruction(MI, Bits, 0x718D, 1);
    break;
  case RL78::OR1_cy_A:
  case RL78::OR1_cy_r:
    // OR1 CY, A.X           71 XE (X -> 0..7 -> 8..F)
    // OR1  CY, saddr.X      71 X6 saddr (X -> 0..7)
    encodeBitManip1RInstruction(MI, Bits, 0x718E, 1);
    break;
  case RL78::XOR1_cy_A:
  case RL78::XOR1_cy_r:
    // XOR1 CY, A.X        71 XF (X -> 0..7 -> 8..F)
    // XOR1 CY, saddr.X    71 X7 saddr (X -> 0..7)
    encodeBitManip1RInstruction(MI, Bits, 0x718F, 1);
    break;
  case RL78::MOV1_cy_r:
    // MOV1 CY, A.X          71 XC (X -> 0..7 -> 8..F)
    encodeBitManip1RInstruction(MI, Bits, 0x718C, 1);
    break;
  case RL78::AND1_cy_saddrx:
  case RL78::OR1_cy_saddrx:
  case RL78::XOR1_cy_saddrx:
  case RL78::MOV1_cy_saddr: {
    // MOV1 CY, saddr.X      71 X4 saddr (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    unsigned int addr = getTargetOpValue(
        MI, 0, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::MOV1_saddr_cy: {
    // MOV1 saddr.X, CY      71 X1 saddr (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    unsigned int addr = getTargetOpValue(
        MI, 0, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::MOV1_sfr_cy: {
    // MOV1 sfr.x. CY  71 x9 sfr   (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    RL78ReportError(MI.getOperand(0).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(0).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "Instruction using illegal operand");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::MOV1_sfrReg_cy: {
    // MOV1 sfr.x. CY  71 x9 sfr   (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    Bits |= sfrRegisterToSfraddr[MI.getOperand(0).getReg()] & 0xFF;
    break;
  }
  case RL78::AND1_cy_sfr:
  case RL78::OR1_cy_sfr:
  case RL78::XOR1_cy_sfr: {
    // XOR1 CY, sfr.X    71 0F sfr (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    RL78ReportError(MI.getOperand(0).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(0).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "Instruction using illegal operand");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::AND1_cy_sfrReg:
  case RL78::OR1_cy_sfrReg:
  case RL78::XOR1_cy_sfrReg: {
    // XOR1 CY, sfr.X    71 0F sfr (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    Bits |= sfrRegisterToSfraddr[MI.getOperand(0).getReg()] & 0xFF;
    break;
  }
  case RL78::MOV1_cy_sfr: {
    // MOV1 CY, sfr.x ;71 xC sfr   (X -> 0..7)
    Bits |= (MI.getOperand(2).getImm() & 0xF) << 12;
    RL78ReportError(MI.getOperand(1).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(1).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "Instruction using illegal operand");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::MOV1_cy_sfrReg: {
    // MOV1 CY, sfr.x ;71 xC sfr   (X -> 0..7)
    Bits |= (MI.getOperand(2).getImm() & 0xF) << 12;
    Bits |= sfrRegisterToSfraddr[MI.getOperand(1).getReg()] & 0xFF;
    break;
  }
  case RL78::MOV1_psw_cy:
  case RL78::MOV1_cy_psw:
    // MOV1 PSW.X, CY		71 X9 FA (X -> 0..7)
    // MOV1 CY, PSW.0		71 XC FA (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    break;

  case RL78::XOR1_cy_PSW:
  case RL78::OR1_cy_PSW:
  case RL78::AND1_cy_PSW:
    // AND1 CY, PSW.0         ;71 0D FA  (X -> 0..7 -> 8..F)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    break;
  case RL78::SET1_PSW:
  case RL78::CLR1_PSW:
    Bits |= (MI.getOperand(2).getImm() & 0xF) << 12;
    break;
  case RL78::SET1_abs16:
  case RL78::CLR1_abs16: {
    // SET1 !addr16.X        71 X0 adrl adrh (X -> 0..7)
    // CLR1 !addr16.X        71 X8 adrl adrh (X -> 0..7)
    Bits += MI.getOperand(1).getImm() << 20;
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U_RAM);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::MOV1_cy_memr:
  case RL78::AND1_cy_memr:
  case RL78::OR1_cy_memr:
  case RL78::XOR1_cy_memr:
    // MOV1 CY, [HL].X       71 X4 (X -> 0..7 -> 8..F)
    // AND1 CY, [HL].X       71 X5 (X -> 0..7 -> 8..F)
    // OR1 CY, [HL].X        71 X6 (X -> 0..7 -> 8..F)
    // XOR1 CY, [HL].X       71 X7 (X -> 0..7 -> 8..F)
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(1).getImm() << 4;
    break;
  case RL78::SET1_memr:
  case RL78::CLR1_memr:
    // SET1 [HL].X           71 X2 (X -> 0..7 -> 8..F)
    // CLR1 [HL].X           71 X3 (X -> 0..7 -> 8..F)
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(1).getImm() << 4;
    break;
  case RL78::MOV1_memr_cy:
    // MOV1 [HL].X, CY       71 X1 (X -> 0..7 -> 8..F)
    RL78ReportError(MI.getOperand(0).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(1).getImm() << 4;
    break;
  case RL78::MOV1_cy_esmemr:
    // MOV1 CY, ES:[HL].0    ;11 71 84
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(3).getImm() << 4;
    break;
  case RL78::MOV1_esmemr_cy:
    // MOV1 ES:[HL].0, CY    ;11 71 81
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(2).getImm() << 4;
    break;
  case RL78::AND1_esmemr:
  case RL78::OR1_esmemr:
  case RL78::XOR1_esmemr:
    // AND1 CY, ES:[HL].0       ;11 71 85
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(3).getImm() << 4;
    break;
  case RL78::SET1_sfr:
  case RL78::CLR1_sfr: {
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    RL78ReportError(MI.getOperand(0).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(0).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "Instruction using illegal operand");
    Bits |= immediateValue & 0xFF;
    break;
  }
  case RL78::SET1_saddr:
  case RL78::CLR1_saddr: {
    // SET1 saddr.X          71 X2 saddr (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    unsigned int addr = getTargetOpValue(
        MI, 0, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::SET1_sfrReg:
  case RL78::CLR1_sfrReg: {
    // SET1 saddr.X          71 X2 saddr (X -> 0..7)
    Bits |= (MI.getOperand(1).getImm() & 0xF) << 12;
    Bits |= sfrRegisterToSfraddr[MI.getOperand(0).getReg()] & 0xFF;
    break;
  }
  case RL78::SET1_esaddr16:
  case RL78::CLR1_esaddr16: {

    // SET1 ES:!addr16.0            ;11 71 x0 adrl adrh
    Bits |= (MI.getOperand(2).getImm() & 0xF) << 20;

