ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
    unsigned int addressValue = getTargetOpValue(
        MI, 1, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U_16);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::SET1_esmemr:
  case RL78::CLR1_esmemr:
    // SET1 ES:[HL].0               ;11 71 82
    RL78ReportError(MI.getOperand(1).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits |= (MI.getOperand(2).getImm() & 0xF) << 4;
    break;
  case RL78::CALL_cs_rp:
  case RL78::CALL_rp:
    // CALL AX           61 CA
    // CALL BC           61 DA
    // CALL DE           61 EA
    // CALL HL           61 FA
    Bits += (MI.getOperand(0).getReg() - RL78::RP0) << 4;
    break;
  case RL78::CALL_rp_fp:
    Bits += (unsigned long long)(MI.getOperand(0).getReg() - RL78::RP0) << 36;
    Bits |= (getTargetOpValue(MI, 2, 4, Fixups, STI,
                              (MCFixupKind)RL78::fixup_RL78_DIR8U) &
             0xFF)
            << 8;
    break;
  case RL78::CALL_addr16:
  case RL78::CALL_sym16: {
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::CALL_addr16_fp:
  case RL78::CALL_sym16_fp: {
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U);
    unsigned long long laddr = (0x00FF & addressValue) << 8;
    unsigned long long uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr) << 32;
    Bits |= (getTargetOpValue(MI, 2, 5, Fixups, STI,
                              (MCFixupKind)RL78::fixup_RL78_DIR8U) &
             0xFF)
            << 8;
    break;
  }
  case RL78::CALL_addr20:
  case RL78::CALL_sym20: {
    // call !!$addr20
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U);
    unsigned int laddr = (0x0000FF & addressValue) << 16;
    unsigned int uaddr = (0x00FF00 & addressValue);
    unsigned int saddr = (0xFF0000 & addressValue) >> 16;
    Bits |= (uaddr | laddr | saddr);
    break;
  }
  case RL78::CALL_addr20_fp:
  case RL78::CALL_sym20_fp: {
    uint64_t addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U);
    uint64_t laddr = (0x0000FF & addressValue) << 16;
    uint64_t uaddr = (0x00FF00 & addressValue);
    uint64_t saddr = (0xFF0000 & addressValue) >> 16;
    Bits |= (uaddr | laddr | saddr) << 32;
    Bits |= (getTargetOpValue(MI, 2, 5, Fixups, STI,
                              (MCFixupKind)RL78::fixup_RL78_DIR8U) &
             0xFF)
            << 8;
    break;
  }
  case RL78::CALL_addr16rel: {
    // call $addr16
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16S_PCREL);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::CALLT_addr5: {
    // CALLT[0080h]; 61 84
    // CALLT[0082h]; 61 94
    // CALLT[008Eh]; 61 F4
    // CALLT[0090h]; 61 85
    // CALLT[009Ch]; 61 E5
    // CALLT[009Eh]; 61 F5
    // CALLT[00A0h]; 61 86
    // CALLT[00ACh]; 61 E6
    // CALLT[00AEh]; 61 F6
    // CALLT[00B0h]; 61 87
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR_CALLT);
    if (addr > 0)
      Bits = 0x6184 + ((((addr - 0x80) & 0x0F) / 2) << 4) +
             (((addr - 0x80) & 0xF0) >> 4);
    break;
  }
  case RL78::ADDW_sp_imm:
  case RL78::SUBW_sp_imm:
    // ADDW SP, #byte    10 data
    // SUBW SP, #byte    20 data
    Bits |= getTargetOpValue(MI, 2, 1, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    break;
  case RL78::B_BC:
  case RL78::B_BNC:
  case RL78::B_BZ:
  case RL78::B_BNZ:
  case RL78::B_cc:
  case RL78::B_BNH:
    // BC $addr20        DC adr
    // BNC $addr20       DE adr
    // BZ $addr20        DD adr
    // BNZ $addr20       DF adr
    if ((MI.getOperand(1).getImm() != RL78CC::RL78CC_H) &&
        (MI.getOperand(1).getImm() != RL78CC::RL78CC_NH)) {
      Size = 2;
      switch (MI.getOperand(1).getImm()) {
      case RL78CC::RL78CC_C:
        Bits = 0xDC00;
        break;
      case RL78CC::RL78CC_NC:
        Bits = 0xDE00;
        break;
      case RL78CC::RL78CC_Z:
        Bits = 0xDD00;
        break;
      case RL78CC::RL78CC_NZ:
        Bits = 0xDF00;
        break;
      }
      unsigned int addr = getTargetOpValue(
          MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
      Bits |= addr & 0xFF;

      break;
    }
    // BH $addr20        61 C3 adr (already set).
    // BNH $addr20       61 D3 adr (chaamge opcode if necesarry).
    else {
      Size = 3;
      if (MI.getOperand(1).getImm() == RL78CC::RL78CC_NH)
        Bits = 0x61D300;
      else
        Bits = 0x61C300;
      unsigned int addr = getTargetOpValue(
          MI, 0, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
      Bits |= addr & 0xFF;
    }
    break;

  case RL78::SK_cc:
    switch (MI.getOperand(1).getImm()) {
    // SKC               61 C8
    // case RL78CC::RL78CC_C:
    // SKNC              61 D8
    case RL78CC::RL78CC_NC:
      Bits = 0x61D8;
      break;
    // SKZ               61 E8
    case RL78CC::RL78CC_Z:
      Bits = 0x61E8;
      break;
    // SKNZ              61 F8
    case RL78CC::RL78CC_NZ:
      Bits = 0x61F8;
      break;
    // SKH               61 E3
    case RL78CC::RL78CC_H:
      Bits = 0x61E3;
      break;
    // SKNH              61 F3
    case RL78CC::RL78CC_NH:
      Bits = 0x61F3;
      break;
    }
    break;
  case RL78::SK_cc_nodst:
    switch (MI.getOperand(0).getImm()) {
    // SKC               61 C8
    // case RL78CC::RL78CC_C:
    // SKNC              61 D8
    case RL78CC::RL78CC_NC:
      Bits = 0x61D8;
      break;
    // SKZ               61 E8
    case RL78CC::RL78CC_Z:
      Bits = 0x61E8;
      break;
    // SKNZ              61 F8
    case RL78CC::RL78CC_NZ:
      Bits = 0x61F8;
      break;
    // SKH               61 E3
    case RL78CC::RL78CC_H:
      Bits = 0x61E3;
      break;
    // SKNH              61 F3
    case RL78CC::RL78CC_NH:
      Bits = 0x61F3;
      break;
    }
    break;
  case RL78::BR_rel8: {
    // BR $addr20    EF adr
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BR_rel16: {
    // BR $!addr20 EE adrl adrh
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16S_PCREL);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::BR_addr16: {
    // BR !addr16 ED adrl adrh
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR16U);
    unsigned int laddr = (0x00FF & addressValue) << 8;
    unsigned int uaddr = (0xFF00 & addressValue) >> 8;
    Bits |= (uaddr | laddr);
    break;
  }
  case RL78::BR_addr20: {
    // BR !!$addr20
    unsigned int addressValue = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR20U);
    unsigned int laddr = (0x0000FF & addressValue) << 16;
    unsigned int uaddr = (0x00FF00 & addressValue);
    unsigned int saddr = (0xFF0000 & addressValue) >> 16;
    Bits |= (uaddr | laddr | saddr);
    break;
  }
  case RL78::BTBF_A: {
    // BT A.X, $addr20           31 X3 adr (X -> 0..7)
    // BF A.X, $addr20           31 X5 adr (X -> 0..7)
    if (MI.getOperand(1).getImm() == RL78CC::RL78CC_NZ)
      Bits += 0x200;
    Bits += MI.getOperand(3).getImm() << 12;
    unsigned int addr = getTargetOpValue(
        MI, 0, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTCLR_saddr: {
    // BTCLR saddr.X, $addr20    31 X0 saddr adr (X -> 0..7)
    Bits += MI.getOperand(3).getImm() << 20;
    unsigned int addr = getTargetOpValue(
        MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= (addr & 0xFF) << 8;

    addr = getTargetOpValue(MI, 0, 3, Fixups, STI,
                            (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTBF_saddr: {
    // BT saddr.X, $addr20       31 X2 saddr adr (X -> 0..7)
    // BF saddr.X, $addr20       31 X4 saddr adr (X -> 0..7)
    Bits += MI.getOperand(3).getImm() << 20;
    if (MI.getOperand(1).getImm() == RL78CC::RL78CC_NZ)
      Bits += 0x20000;

