ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
    unsigned int addr = getTargetOpValue(
        MI, 2, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= (addr & 0xFF) << 8;
    addr = getTargetOpValue(MI, 0, 3, Fixups, STI,
                            (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTBF_PSWi_addr: {
    // BF PSW.0, $addr20 ;31 84 FA adr
    // BT PSW.0, $addr20 ;31 82 FA adr
    Bits += MI.getOperand(3).getImm() << 20;

    if (MI.getOperand(1).getImm() == RL78CC::RL78CC_NZ)
      Bits += 0x20000;
    unsigned int addr = getTargetOpValue(
        MI, 0, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTCLR_PSWi_addr: {
    // BTCLR PSW.0, $addr20 ;31 80 FA adr
    Bits += MI.getOperand(2).getImm() << 20;
    unsigned int addr = getTargetOpValue(
        MI, 0, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTCLR_memr: {
    // BTCLR [HL].X, $addr20     31 X1 adr (X -> 0..7 -> 8..F)
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(3).getImm() << 12;
    unsigned int addr = getTargetOpValue(
        MI, 0, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTBF_memr: {

    // BT [HL].X, $addr20        31 X3 adr (X -> 0..7 -> 8..F)
    // BF [HL].X, $addr20        31 X5 adr (X -> 0..7 -> 8..F)
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    if (MI.getOperand(1).getImm() == RL78CC::RL78CC_NZ)
      Bits += 0x200;
    Bits += MI.getOperand(3).getImm() << 12;
    unsigned int addr = getTargetOpValue(
        MI, 0, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTBF_esmemr: {
    // BF ES:[HL].0, $addr20 ;11 31 85 adr
    // BT ES:[HL].0, $addr20 ;11 31 83 adr
    RL78ReportError(MI.getOperand(3).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    if (MI.getOperand(1).getImm() == RL78CC::RL78CC_NZ)
      Bits += 0x200;
    Bits += MI.getOperand(4).getImm() << 12;
    unsigned int addr = getTargetOpValue(
        MI, 0, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTCLR_esmemr: {
    // BTCLR ES:[HL].X, $addr20  11 31 X1 adr (X -> 0..7 -> 8..F)
    RL78ReportError(MI.getOperand(2).getReg() == RL78::RP6,
                    "Instruction using illegal register.");
    Bits += MI.getOperand(3).getImm() << 12;
    unsigned int addr = getTargetOpValue(
        MI, 0, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTCLR_sfri_addr: {
    // BTCLR sfr.0, $addr20 ;31 80 sfr adr
    Bits += MI.getOperand(2).getImm() << 20;

    RL78ReportError(MI.getOperand(1).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(1).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "Instruction using illegal operand");
    Bits |= (immediateValue & 0xFF) << 8;

    unsigned int addr = getTargetOpValue(
        MI, 0, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTCLR_sfrRegi_addr: {
    // BTCLR sfr.0, $addr20 ;31 80 sfr adr
    Bits += MI.getOperand(2).getImm() << 20;
    Bits |= (sfrRegisterToSfraddr[MI.getOperand(1).getReg()] & 0xFF) << 8;
    unsigned int addr = getTargetOpValue(
        MI, 0, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTBF_sfri_addr: {
    // BF sfr.0, $addr20 ;31 84 sfr adr
    // BT sfr.0, $addr20 ;31 82 sfr adr
    if (MI.getOperand(1).getImm() == RL78CC::RL78CC_NZ)
      Bits += 0x20000;
    Bits += MI.getOperand(3).getImm() << 20;

    RL78ReportError(MI.getOperand(2).isImm(),
                    "sfr operand can be special register or immediate only");
    int64_t immediateValue = MI.getOperand(2).getImm();
    RL78ReportError(immediateValue >= 0xFFF00 && immediateValue <= 0xFFFFF,
                    "Instruction using illegal operand");
    Bits |= (immediateValue & 0xFF) << 8;

    unsigned int addr = getTargetOpValue(
        MI, 0, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTBF_sfrRegi_addr: {
    // BF sfr.0, $addr20 ;31 84 sfr adr
    // BT sfr.0, $addr20 ;31 82 sfr adr
    if (MI.getOperand(1).getImm() == RL78CC::RL78CC_NZ)
      Bits += 0x20000;
    Bits += MI.getOperand(3).getImm() << 20;
    Bits |= (sfrRegisterToSfraddr[MI.getOperand(2).getReg()] & 0xFF) << 8;
    unsigned int addr = getTargetOpValue(
        MI, 0, 3, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::BTCLR_A: {
    // BTCLR A.X, $addr20        31 X1 adr (X -> 0..7)
    Bits += MI.getOperand(4).getImm() << 12;
    unsigned int addr = getTargetOpValue(
        MI, 1, 2, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8S_PCREL);
    Bits |= addr & 0xFF;
    break;
  }
  case RL78::SEL:
    // SEL RB0           61 CF
    // SEL RB1           61 DF
    // SEL RB2           61 EF
    // SEL RB3           61 FF
    Bits += MI.getOperand(0).getImm() << 4;
    break;
  case RL78::PUSH_rp:
  case RL78::POP_rp:
    // PUSH AX           C1
    // PUSH BC           C3
    // PUSH DE           C5
    // PUSH HL           C7
    // POP AX            C0
    // POP BC            C2
    // POP DE            C4
    // POP HL            C6
    Bits += (MI.getOperand(0).getReg() - RL78::RP0) * 2;
    break;
  case RL78::ADD_r_saddr:
  case RL78::ADDC_r_saddrabs:
  case RL78::SUB_r_saddr:
  case RL78::SUBC_r_saddr:
  case RL78::AND_r_saddr:
  case RL78::OR_r_saddr:
  case RL78::XOR_r_saddr: {
    // XOR A, saddr      7B saddr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(
        MI, 2, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= (addr & 0xFF);
    break;
  }
  case RL78::CMP_r_saddr: {
    // CMP A, saddr          4B saddr
    RL78ReportError(MI.getOperand(0).getReg() == RL78::R1,
                    "Instruction using illegal register.");
    unsigned int addr = getTargetOpValue(
        MI, 1, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= (addr & 0xFF);
    break;
  }
  case RL78::CMP_saddr_imm:
  case RL78::XOR_saddr_imm:
  case RL78::OR_saddr_imm:
  case RL78::AND_saddr_imm:
  case RL78::ADD_saddr_imm:
  case RL78::SUB_saddr_imm:
  case RL78::SUBC_saddr_imm:
  case RL78::ADDC_saddrabs_imm: {
    // ADD saddr, #byte  0A saddr data
    Bits |= getTargetOpValue(MI, 1, 2, Fixups, STI,
                             (MCFixupKind)RL78::fixup_RL78_DIR8U) &
            0xFF;
    unsigned int addr = getTargetOpValue(
        MI, 0, 1, Fixups, STI, (MCFixupKind)RL78::fixup_RL78_DIR8U_SAD);
    Bits |= (addr & 0xFF) << 8;
    break;
  }
  default:
    break;
  }
  //  Although we set the endianness to big, RL78 is little endian, writing it
  //  this way
  // makes it more easily to follow the documentation Chapter "5.6 Instruction
  // Format".
  switch (Size) {
  case 1:
    support::endian::write<uint8_t>(OS, Bits, support::big);
    break;
  case 2:
    support::endian::write<uint16_t>(OS, Bits, support::big);
    break;
  case 3:
    support::endian::write<uint16_t>(OS, Bits >> 8, support::big);
    support::endian::write<uint8_t>(OS, Bits, support::big);
    break;
  case 4:
    support::endian::write<uint32_t>(OS, Bits, support::big);
    break;
  case 5:
    support::endian::write<uint32_t>(OS, Bits >> 8, support::big);
    support::endian::write<uint8_t>(OS, Bits, support::big);
    break;
  case 6:
    support::endian::write<uint16_t>(OS, Bits >> 32, support::big);
    support::endian::write<uint32_t>(OS, Bits, support::big);
    break;
  case 7:
    support::endian::write<uint16_t>(OS, Bits >> 40, support::big);
    support::endian::write<uint8_t>(OS, Bits >> 32, support::big);
    support::endian::write<uint32_t>(OS, Bits, support::big);
    break;
  case 8:
    support::endian::write<uint32_t>(OS, Bits >> 32, support::big);
    support::endian::write<uint32_t>(OS, Bits, support::big);
    break;
  default:
    llvm_unreachable("Invalid instruction size!");
  }

  ++MCNumEmitted; // Keep track of the # of mi's emitted.
}

unsigned
RL78MCCodeEmitter::getMachineOpValue(const MCInst &MI, const MCOperand &MO,
                                     SmallVectorImpl<MCFixup> &Fixups,
                                     const MCSubtargetInfo &STI) const {
  if (MO.isReg())
    return Ctx.getRegisterInfo()->getEncodingValue(MO.getReg());

