ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCCodeEmitter.cpp
  if (MO.isImm())
    return MO.getImm();

  llvm_unreachable("Unhandled expression!");
  return 0;
}

unsigned RL78MCCodeEmitter::getTargetOpValue(const MCInst &MI, unsigned OpNo,
                                             uint32_t offset,
                                             SmallVectorImpl<MCFixup> &Fixups,
                                             const MCSubtargetInfo &STI,
                                             enum MCFixupKind fixup1) const {
  const MCOperand &MO = MI.getOperand(OpNo);
  if (MO.isImm()) {
    int64_t immediateValue = MO.getImm();
    switch (static_cast<RL78::Fixups>(fixup1)) {
    case RL78::fixup_RL78_DIR8S_PCREL:
      RL78ReportError(immediateValue >= -128 && immediateValue <= 127,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR16S_PCREL:
      RL78ReportError(immediateValue >= -32768 && immediateValue <= 32767,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR3U:
      RL78ReportError(immediateValue >= 0x0 && immediateValue <= 0x7,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR8U:
      RL78ReportError(immediateValue >= -128 && immediateValue <= 255,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR8U_SAD:
      RL78ReportError(immediateValue >= 0xFFE20 && immediateValue <= 0XFFF1F,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR8UW_SAD:
      RL78ReportError(immediateValue >= 0xFFE20 && immediateValue <= 0xFFFFF &&
                          immediateValue % 2 == 0,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR16U:
      RL78ReportError(immediateValue >= -32768 && immediateValue <= 65536,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR16U_RAM:
    case RL78::fixup_RL78_DIR16UW_RAM:
      RL78ReportError(immediateValue >= -65536 && immediateValue <= 0xFFFFF,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR20U:
      RL78ReportError(immediateValue >= 0x00000 && immediateValue <= 0xFFFFF,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR20U_16:
    case RL78::fixup_RL78_DIR20UW_16:
      RL78ReportError(immediateValue >= -32768 && immediateValue <= 65536,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR32U:
      RL78ReportError(immediateValue >= INT32_MIN && immediateValue <= UINT32_MAX,
                      "Instruction using illegal operand");
      break;
    case RL78::fixup_RL78_DIR_CALLT:
      RL78ReportError(immediateValue >= 0x80 && immediateValue <= 0xBF &&
                          immediateValue % 2 == 0,
                      "Instruction using illegal operand");
      break;
    default:
      break;
    }
  }

  if (MO.isReg() || MO.isImm())
    return getMachineOpValue(MI, MO, Fixups, STI);

  unsigned valueSize;
  // Deduce the expected expression's result value size
  switch (static_cast<RL78::Fixups>(fixup1))
  {
  default: 
      // The missing fixups are doing pushes/pops on the relocation "stack",
      // so they should not appear as last, value producing fixups.
      llvm_unreachable("Unhandled fixup!");
      break;
  case RL78::fixup_RL78_DIR3U:
      valueSize = 3;
      break;
  case RL78::fixup_RL78_DIR8S_PCREL:
  case RL78::fixup_RL78_DIR8U:
  case RL78::fixup_RL78_DIR8U_SAD:
  case RL78::fixup_RL78_DIR8UW_SAD:
  case RL78::fixup_RL78_ABS8U:
  case RL78::fixup_RL78_DIR_CALLT:
      valueSize = 8;
      break;
  case RL78::fixup_RL78_DIR16S_PCREL:
  case RL78::fixup_RL78_DIR16U:
  case RL78::fixup_RL78_DIR16U_RAM:
  case RL78::fixup_RL78_DIR16UW_RAM:
  case RL78::fixup_RL78_DIR20U_16:
  case RL78::fixup_RL78_DIR20UW_16:
  case RL78::fixup_RL78_ABS16U:
  case RL78::fixup_RL78_ABS16UW:
      valueSize = 16;
      break;
  case RL78::fixup_RL78_DIR20U:
      valueSize = 24;
      break;
  case RL78::fixup_RL78_ABS32U:
  case RL78::fixup_RL78_DIR32U:
      valueSize = 32;
      break;
  }


  if (MO.isExpr() && fixup1 != RL78::fixup_RL78_DIR_CALLT) {
    RL78MCExpr::createFixupsForExpression(MO.getExpr(), offset, valueSize,
                                          Fixups, true, fixup1, Ctx, MO.getExpr()->getLoc());
    return 0;
  } 

  Fixups.push_back(MCFixup::create(offset, MO.getExpr(), fixup1));

  return 0;
}

#define ENABLE_INSTR_PREDICATE_VERIFIER
#include "RL78GenMCCodeEmitter.inc"

MCCodeEmitter *llvm::createRL78MCCodeEmitter(const MCInstrInfo &MCII,
                                             const MCRegisterInfo &MRI,
                                             MCContext &Ctx) {
  return new RL78MCCodeEmitter(MCII, Ctx);
}
